# Основы pandas

In [1]:
import pandas as pd

Пример забора данных с сайтов

In [3]:
pd.read_html('http://www.cbr.ru')

[  Курсы валют на 21.03.2020 на 24.03.2020
 0  Доллар США      78,0443₽      80,8815₽
 1        Евро      84,1552₽      86,7050₽]

In [4]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [10]:
df[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  22.03.20    798695    796745    805745   795395
 1  21.03.20    799780    799780    799780   799780
 2  20.03.20    800126    797505    801825   773905
 3  19.03.20    797495    809485    826660   785405
 4  18.03.20    809528    753320    829725   749940
 5  17.03.20    753335    744145    754965   734305
 6  16.03.20    744113    736010    754705   726745
 7  15.03.20    728445    725645    731195   719495
 8  13.03.20    724200    749340    749463   720395,
        Имя  Unnamed: 1      %    курс                 Дата
 0  EUR/RUB         NaN  13537   86255  23.03.2020 19:23:00
 1  USD/RUB         NaN   5102   80277  23.03.2020 19:23:00
 2  CHF/RUB         NaN   9407  816079  23.03.2020 19:23:00
 3  JPY/RUB         NaN   1892      72  23.03.2020 19:23:00
 4  GBP/RUB         NaN  -3717  920895  23.03.2020 19:24:00
 5  NOK/RUB         NaN  45334   70397  23.03.2020 19:23:00
 6  AUD/RUB         NaN  14932  462695  23.03.2020 19:24:00
 7  NZD/RUB         NaN  18797  455929  23.03.2020 19:23:00
 8  TRY/RUB         NaN  -1084  121534  23.03.2020 19:23:00]

In [11]:
df[1]

       Имя  Unnamed: 1      %    курс                 Дата
0  EUR/RUB         NaN  13537   86255  23.03.2020 19:23:00
1  USD/RUB         NaN   5102   80277  23.03.2020 19:23:00
2  CHF/RUB         NaN   9407  816079  23.03.2020 19:23:00
3  JPY/RUB         NaN   1892      72  23.03.2020 19:23:00
4  GBP/RUB         NaN  -3717  920895  23.03.2020 19:24:00
5  NOK/RUB         NaN  45334   70397  23.03.2020 19:23:00
6  AUD/RUB         NaN  14932  462695  23.03.2020 19:24:00
7  NZD/RUB         NaN  18797  455929  23.03.2020 19:23:00
8  TRY/RUB         NaN  -1084  121534  23.03.2020 19:23:00

Импорт данных из файла

In [27]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [13]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [14]:
type(data)

pandas.core.frame.DataFrame

In [26]:
#если надо указать свои заголовки и разделитель
data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
data.head()

ParserError: Too many columns specified: expected 4 and found 1

In [17]:
# количество строк в датафрейме

len(data)

1189482

In [18]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [19]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [38]:
datat = pd.read_csv('transactions.csv')
datat.head()
datat.shape

(60, 8)

In [39]:
datat.shape

(60, 8)

### Основные сведения о датафрейме

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 8 columns):
Year       60 non-null int64
Month      60 non-null int64
ID         60 non-null object
Product    60 non-null object
Amount     60 non-null int64
Price      60 non-null int64
Total      60 non-null int64
Cost       60 non-null int64
dtypes: int64(6), object(2)
memory usage: 3.9+ KB

In [24]:
# немного статистики

data.describe()

         Year      Month     Amount        Price         Total         Cost
count    60.0  60.000000  60.000000    60.000000     60.000000    60.000000
mean   2017.0   7.250000   3.650000  4427.183333  14072.183333  1063.333333
std       0.0   3.337638   2.184886  2506.427558   8966.190387   902.297757
min    2017.0   1.000000   1.000000  1265.000000   1896.000000   200.000000
25%    2017.0   5.000000   2.000000  1896.000000   7584.000000   650.000000
50%    2017.0   7.000000   3.000000  3760.000000  11280.000000   800.000000
75%    2017.0  10.250000   5.000000  5175.000000  17236.000000  1200.000000
max    2017.0  12.000000  10.000000  8618.000000  37600.000000  4200.000000

### Отдельный столбец (тип Series)

In [28]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [29]:
# или так

data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [30]:
type(data['year'])

pandas.core.series.Series

In [31]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [32]:
# уникальные значения в столбце

data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71], dtype=int64)

In [33]:
len(data['category'].unique())

71

In [34]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [35]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [37]:
data['category'].value_counts(normalize=True).head() * 100

67    11.258346
27     8.209036
24     6.316363
42     5.394029
37     5.225468
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [40]:
datat = pd.read_csv('transactions.csv')
datat.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [42]:
datat['Product'].value_counts().head()

_5    11
_2     8
_8     8
_4     7
_3     7
Name: Product, dtype: int64

In [43]:
pd.read_csv('transactions.csv').Product.value_counts().head(1)

_5    11
Name: Product, dtype: int64

# Фильтры

In [44]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [45]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [46]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

### Отфильтруем строки с потреблением выше среднего

In [47]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [48]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [49]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [50]:
# самый популярный способ

data[ data.quantity > average_level ].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

### Как определить используемый вариант названия страны?

In [51]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [72]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [78]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') & (data['year'] < 2010) ]

filtered_countries.head()

                   country  year    quantity  category
822281  Russian Federation  1992  24343404.0        42
830102  Russian Federation  1992  24065404.0        42
834436  Russian Federation  1992  16947027.0        42
838064  Russian Federation  1992  10794027.0        42
842213  Russian Federation  1992  10794027.0        42

In [ ]:
filtered_countries['country'].unique()

In [57]:
# фильтры на номер строки

data.loc[1000:1005]

      country  year  quantity  category
1000  Austria  1998     -14.0         1
1001  Austria  1997       5.0         1
1002  Austria  1996      -1.0         1
1003  Austria  1995     -10.0         1
1004  Austria  1994      -8.0         1
1005  Austria  1993     -11.0         1

# Сортировка

In [58]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [59]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [61]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head(200)

             country  year      quantity  category
835127   Afghanistan  2014  1.935442e+06        42
491541   Afghanistan  2014  6.600000e+04        31
492004   Afghanistan  2014  6.600000e+04        31
492292   Afghanistan  2014  6.600000e+04        31
791301   Afghanistan  2014  5.537080e+03        42
...              ...   ...           ...       ...
547874       Albania  2014  1.591000e+02        32
552338       Albania  2014  1.591000e+02        32
650368       Albania  2014  1.572900e+02        37
1001473      Albania  2014  1.515000e+02        60
988796       Albania  2014  1.511500e+02        60

[200 rows x 4 columns]

### Параметр inplace

In [62]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [64]:
data.sort_values('country', ascending=True, inplace=True)

In [65]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

In [69]:
filtered_datat = datat[ (datat['Product']=='_8')]
filtered_datat.sort_values(by=['Cost'], ascending=[False]).head(1)

    Year  Month    ID Product  Amount  Price  Total  Cost
54  2017     12  t055      _8       2   3760   7520  2400